// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Clear();

Console.Write("Введите число: ");
int a = int.Parse(ConsoleReadLine());

if (a > 99)
{
    
}
else
{
    Console.WriteLine("Третьей цифры тут нет!");
}